projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_003_medium_mesh_validation/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}
