projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_003_medium_mesh_validation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       36019;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       36060;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          440;
        startFace       36101;
    }
    frontAndBack
    {
        type            patch;
        nFaces          19992;
        startFace       36541;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1824;
        startFace       56533;
    }
)

// ************************************************************************* //
