projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_003_medium_mesh_validation/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;

snap            true;

addLayers       false;

geometry
{
    cylinder
    {
        type            triSurfaceMesh;
        file            "cylinder.stl";
        name            cylinder;
    }
}

castellatedMeshControls
{
    maxLocalCells   1000000;
    maxGlobalCells  2000000;
    minRefinementCells 0;
    nCellsBetweenLevels 2;
    features        ( );
    refinementSurfaces
    {
        cylinder
        {
            level           ( 3 3 );
            patchInfo
            {
                type            wall;
            }
        }
    }
    resolveFeatureAngle 30;
    refinementRegions
    {
    }
    locationInMesh  ( 0.5 0.2 0 );
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2;
    nSolveIter      30;
    nRelaxIter      5;
}

addLayersControls
{
    relativeSizes   true;
    layers
    {
    }
    expansionRatio  1;
    finalLayerThickness 0.3;
    minThickness    0.1;
    nGrow           0;
    featureAngle    60;
    nRelaxIter      5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
}

meshQualityControls
{
    maxNonOrtho     70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}

mergeTolerance  1e-06;

castellatedMeshControls.refinementSurfaces.cylinder.level ( 3 3 );


// ************************************************************************* //
